Tekla Open API Reference for Tekla Structures 2025
WpfMeshCatalog Class
 The WpfMeshCatalog class represents a group of controls to select meshes using the mesh catalog.
 WpfMeshCatalog
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfMeshCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfMeshCatalog : UserControl,
	IComponentConnector
Public Class WpfMeshCatalog
	Inherits UserControl
	Implements IComponentConnector
The WpfMeshCatalog type exposes the following members.
Constructors
Name | Description
WpfMeshCatalog
 Initiates a new instance of the control.
Top
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedMeshGrade
 The mesh grade in the control.
SelectedMeshName
 The mesh name in the control.
Top
Methods
Name | Description
InitializeComponent
 InitializeComponent
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace